<?php
namespace Page;
use Helper\Common;
class ReportControlling
{

    public static $URL = '/#/pages/controlling';
    public static $DeleteDate = '/html/body/app/main/pages/div/div/controlling-report/controlling-report-table/div/div[1]/div[1]/my-date-picker/div/div/div/button[1]';
    public static $Date = '/html/body/app/main/pages/div/div/controlling-report/controlling-report-table/div/div[1]/div[1]/my-date-picker/div/div/input';
    //Эталонные знчения строчек
    //Закомментировал т.к. есть ТУДУ в ReportControllingCest на тему таблицы
    //public static $etalon = 'ИнгредиентыПоголовьеИнгредиент1Ингредиент2Ингрелиент3KK1Ингредиент4KK2ВеспогруппеФизиология1,кормление1КСВ50%50%50%50%50%50%План,кгна1головуСух1302,03,65,76,97,30,726,3Физ1304,07,211,513,814,71,352,5Фактраздачи,кгна1головуСух1302,03,65,57,27,50,626,5Физ1304,07,211,114,315,11,352,9Фактраздачи,кгвсегоСух260,0467,5718,5930,0979,084,03439,0Физ520,0935,01437,01860,01958,0168,06878,0Физиология1,кормление2КСВ50%50%50%50%50%50%План,кгна1головуСух1301,41,63,32,33,52,014,1Физ1302,83,16,74,67,04,028,3Фактраздачи,кгна1головуСух1301,41,63,32,33,52,014,1Физ1302,83,16,74,67,14,028,3Фактраздачи,кгвсегоСух180,0202,5432,4300,0460,2262,51837,5Физ360,0405,0864,7600,0920,3525,03675,0Физиология1,всекормленияВсегофактраздачи,кгСух440,0670,01150,91230,01439,2346,55276,5Физ880,01340,02301,72460,02878,3693,010553,0Физиология2,кормление1КСВ50%50%50%50%50%50%План,кгна1головуСух702,44,46,98,68,90,531,6Физ704,78,813,717,117,81,163,2Фактраздачи,кгна1головуСух702,44,46,68,99,20,531,9Физ704,78,813,217,718,31,063,7Фактраздачи,кгвсегоСух165,0307,5461,5620,0641,036,02231,0Физ330,0615,0923,01240,01282,072,04462,0Физиология2,кормление2КСВ50%50%50%50%50%50%План,кгна1головуСух701,41,83,42,93,81,614,8Физ702,73,56,95,77,63,229,6Фактраздачи,кгна1головуСух701,41,83,42,93,81,614,8Физ702,73,56,85,77,73,229,6Фактраздачи,кгвсегоСух95,0122,5238,2200,0269,4112,51037,5Физ190,0245,0476,3400,0538,7225,02075,0Физиология2,всекормленияВсегофактраздачи,кгСух260,0430,0699,7820,0910,4148,53268,5Физ520,0860,01399,31640,01820,7297,06537,0Всего,факт,кгСух700,01100,01850,52050,02349,5495,08545,0Физ1400,02200,03701,04100,04699,0990,017090,0';
    public static $etalonStroka1  = 'ИнгредиентыПоголовьеИнгредиент1Ингредиент2Ингрелиент3KK1Ингредиент4KK2Веспогруппе';
    public static $etalonStroka2  = 'Физиология1,кормление1КСВ50%50%50%50%50%50%';
    public static $etalonStroka3  = 'План,кгна1головуСух1302,03,65,76,97,30,726,3';
    public static $etalonStroka4  = 'Физ1304,07,211,513,814,71,352,5';
    public static $etalonStroka5  = 'Фактраздачи,кгна1головуСух1302,03,65,57,27,50,626,5';
    public static $etalonStroka6  = 'Физ1304,07,211,114,315,11,352,9';
    public static $etalonStroka7  = 'Фактраздачи,кгвсегоСух260,0467,5718,5930,0979,084,03439,0';
    public static $etalonStroka8  = 'Физ520,0935,01437,01860,01958,0168,06878,0';
    public static $etalonStroka9 = 'Физиология1,кормление2КСВ50%50%50%50%50%50%';
    public static $etalonStroka10 = 'План,кгна1головуСух1301,41,63,32,33,52,014,1';
    public static $etalonStroka11 = 'Физ1302,83,16,74,67,04,028,3';
    public static $etalonStroka12 = 'Фактраздачи,кгна1головуСух1301,41,63,32,33,52,014,1';
    public static $etalonStroka13 = 'Физ1302,83,16,74,67,14,028,3';
    public static $etalonStroka14 = 'Фактраздачи,кгвсегоСух180,0202,5432,4300,0460,2262,51837,5';
    public static $etalonStroka15 = 'Физ360,0405,0864,7600,0920,3525,03675,0';
    public static $etalonStroka16 = 'Физиология1,всекормленияВсегофактраздачи,кгСух440,0670,01150,91230,01439,2346,55276,5';
    public static $etalonStroka17 = 'Физ880,01340,02301,72460,02878,3693,010553,0';
    public static $etalonStroka18 = 'Физиология2,кормление1КСВ50%50%50%50%50%50%';
    public static $etalonStroka19 = 'План,кгна1головуСух702,44,46,98,68,90,531,6';
    public static $etalonStroka20 = 'Физ704,78,813,717,117,81,163,2';
    public static $etalonStroka21 = 'Фактраздачи,кгна1головуСух702,44,46,68,99,20,531,9';
    public static $etalonStroka22 = 'Физ704,78,813,217,718,31,063,7';
    public static $etalonStroka23 = 'Фактраздачи,кгвсегоСух165,0307,5461,5620,0641,036,02231,0';
    public static $etalonStroka24 = 'Физ330,0615,0923,01240,01282,072,04462,0';
    public static $etalonStroka25 = 'Физиология2,кормление2КСВ50%50%50%50%50%50%';
    public static $etalonStroka26 = 'План,кгна1головуСух701,41,83,42,93,81,614,8';
    public static $etalonStroka27 = 'Физ702,73,56,95,77,63,229,6';
    public static $etalonStroka28 = 'Фактраздачи,кгна1головуСух701,41,83,42,93,81,614,8';
    public static $etalonStroka29 = 'Физ702,73,56,85,77,73,229,6';
    public static $etalonStroka30 = 'Фактраздачи,кгвсегоСух95,0122,5238,2200,0269,4112,51037,5';
    public static $etalonStroka31 = 'Физ190,0245,0476,3400,0538,7225,02075,0';
    public static $etalonStroka32 = 'Физиология2,всекормленияВсегофактраздачи,кгСух260,0430,0699,7820,0910,4148,53268,5';
    public static $etalonStroka33 = 'Физ520,0860,01399,31640,01820,7297,06537,0';
    public static $etalonStroka34 = 'Всего,факт,кгСух700,01100,01850,52050,02349,5495,08545,0';
    public static $etalonStroka35 = 'Физ1400,02200,03701,04100,04699,0990,017090,0';

    protected $tester;

    public function __construct(\AcceptanceTester $I)
    {
        $this->tester = $I;
    }
    public function controllingDate($controllingDate)
    {
        $I = $this->tester;
        $I->amOnPage(self::$URL);
        $I->click(self::$DeleteDate);
        $I->fillField(self::$Date, $controllingDate);
        return $this;
    }

    public static function route($param)
    {
        return static::$URL.$param;
    }


}
